In [2]:
import pandas as pd

## Data Structures in Pandas

### Series:

In [9]:
x = [3,4,5,6]
ser = pd.Series(x)
ser1 = pd.Series(x, index=['a','b','c','d'], dtype=float, name="Practice Series")
print(ser)
print(ser1)
print("Acess through default index:",ser1[2],"\nAccess through given index:", ser1['c'])

0    3
1    4
2    5
3    6
dtype: int64
a    3.0
b    4.0
c    5.0
d    6.0
Name: Practice Series, dtype: float64
Acess through default index: 5.0
Access through given index: 5.0

In [16]:
dict = {"name":["Python","CPP","Java","php"], "pos":[15,22,66,39],"rank":[1,3,2,4]}
ser2 = pd.Series(dict)
print(ser2)
ranks = ser2["rank"]
print(ranks, ranks[2])

name    [Python, CPP, Java, php]
pos             [15, 22, 66, 39]
rank                [1, 3, 2, 4]
dtype: object
[1, 3, 2, 4] 2

In [19]:
print(pd.Series([1,3,5,7,9], dtype=int) + pd.Series([2,4,6,8], dtype=int))

0     3.0
1     7.0
2    11.0
3    15.0
4     NaN
dtype: float64

### DataFrame

In [23]:
l = [1,2,3,4,5,6]
df = pd.DataFrame(l)
df

   0
0  1
1  2
2  3
3  4
4  5
5  6

In [36]:
d = {"a":[1,3,5,7,9,11],"b":[0,2,4,6,8,10]}
df2 = pd.DataFrame(d)
print(df2)
print(type(df2))
print(df2["a"])
print(df2["a"][2])

    a   b
0   1   0
1   3   2
2   5   4
3   7   6
4   9   8
5  11  10
<class 'pandas.core.frame.DataFrame'>
0     1
1     3
2     5
3     7
4     9
5    11
Name: a, dtype: int64
5

In [38]:
df3 = pd.DataFrame(d,columns=["b"], index=['q','w','e','r','t','y'])
df3

    b
q   0
w   2
e   4
r   6
t   8
y  10

In [39]:
l2 = [[0,1,2,3],[6,7,8,9]]
df4 = pd.DataFrame(l2)
df4

   0  1  2  3
0  0  1  2  3
1  6  7  8  9

In [40]:
d2={"s":pd.Series([1,3,5,7]),"r":[2,4,6,8]}
df5 = pd.DataFrame(d2)
df5

   s  r
0  1  2
1  3  4
2  5  6
3  7  8

In [41]:
print(df5["s"][2])

5

### Arthemetic Operations

In [3]:
var1 = pd.DataFrame({"A":[0,2,4,6,8], "B":[1,3,5,7,9]})
var1

   A  B
0  0  1
1  2  3
2  4  5
3  6  7
4  8  9

In [5]:
var1["Sum"] = var1["A"]+var1["B"]
var1["Sub"] = var1["A"]-var1["B"]
var1["Mul"] = var1["A"]*var1["B"]
var1["Div"] = var1["A"]/var1["B"]
var1

   A  B  Sum  Sub  Mul       Div
0  0  1    1   -1    0  0.000000
1  2  3    5   -1    6  0.666667
2  4  5    9   -1   20  0.800000
3  6  7   13   -1   42  0.857143
4  8  9   17   -1   72  0.888889

### Logical Operations

In [8]:
var2 = pd.DataFrame({"A":[0,1,2,3,4,5,6,7,8,9]})

var2["Odd"] = var2["A"]%2 != 0
var2

   A    Odd
0  0  False
1  1   True
2  2  False
3  3   True
4  4  False
5  5   True
6  6  False
7  7   True
8  8  False
9  9   True

### Insertion

In [10]:
var3 = pd.DataFrame({"A":[1,2,3,4,5,6],"B":['q','w','e','r','t','y']})
var3

   A  B
0  1  q
1  2  w
2  3  e
3  4  r
4  5  t
5  6  y

In [11]:
var3.insert(1,"A1",['1q','2w','3e','4r','5t','6y'])
var3

   A  A1  B
0  1  1q  q
1  2  2w  w
2  3  3e  e
3  4  4r  r
4  5  5t  t
5  6  6y  y

In [13]:
var3["C"]=var3["A"][:3]
var3

   A  A1  B    C
0  1  1q  q  1.0
1  2  2w  w  2.0
2  3  3e  e  3.0
3  4  4r  r  NaN
4  5  5t  t  NaN
5  6  6y  y  NaN

### Deletion

In [14]:
b = var3.pop("B") #Deleted from Var3 and saved to b
print(b)
var3

0    q
1    w
2    e
3    r
4    t
5    y
Name: B, dtype: object

   A  A1    C
0  1  1q  1.0
1  2  2w  2.0
2  3  3e  3.0
3  4  4r  NaN
4  5  5t  NaN
5  6  6y  NaN

In [15]:
del var3["A"]
var3

   A1    C
0  1q  1.0
1  2w  2.0
2  3e  3.0
3  4r  NaN
4  5t  NaN
5  6y  NaN

### Writing to CSV

In [16]:
df_csv = pd.DataFrame({"Col1":[1,2,3,4,5,6],"Col2":['q','w','e','r','t','y'], "Col3":['a1','s2','d3','f4','g5','h6']})
df_csv

   Col1 Col2 Col3
0     1    q   a1
1     2    w   s2
2     3    e   d3
3     4    r   f4
4     5    t   g5
5     6    y   h6

In [19]:
df_csv.to_csv("PracticeWritingCSV.csv",index=False) #df_csv.to_csv("PracticeWritingCSV",index=False, header[1,2,3,4,5,6]) for new header

### Reading CSV

In [20]:
df = pd.read_csv("Practice_Dataset.csv")
df

,StockID,StockName,Date,OpeningPrice,ClosingPrice,Volume,MarketCap,PE_Ratio,DividendYield,Sector
0,1,Stock_1,2024-03-17,403.21,186.70,143175,6.505402e+11,16.64,0.81,Healthcare
1,2,Stock_2,2024-02-11,395.96,377.70,201937,7.557405e+11,44.14,2.34,Healthcare
2,3,Stock_3,2024-09-21,244.89,150.91,493048,9.032548e+10,16.04,4.98,Technology
3,4,Stock_4,2024-10-12,197.23,342.65,723463,3.893175e+11,35.60,2.68,Healthcare
4,5,Stock_5,2024-02-10,397.50,439.90,856814,9.866424e+11,44.91,1.49,Finance
...,...,...,...,...,...,...,...,...,...,...
995,996,Stock_996,2024-11-07,NaN,458.08,78212,4.955035e+11,33.54,0.75,Consumer Goods
996,997,Stock_997,2024-01-05,332.24,151.44,795331,6.523931e+11,49.27,0.87,Technology
997,998,Stock_998,2024-01-15,174.39,236.24,489014,4.580002e+10,16.75,2.39,Technology
998,999,Stock_999,2024-01-23,235.27,223.29,618597,9.708860e+11,31.24,2.09,Consumer Goods
999,1000,Stock_1000,2023-12-21,350.10,385.36,921650,6.562584e+11,11.34,0.77,Finance

In [41]:
dfl = pd.read_csv("Practice_Dataset.csv",dtype={"StockID":"float"}, skiprows=[2], nrows=6, usecols=["StockID","StockName","OpeningPrice","ClosingPrice"]) #Can also use indexes of coloumns [1,3,4]
dfl

   StockID StockName  OpeningPrice  ClosingPrice
0      1.0   Stock_1        403.21        186.70
1      3.0   Stock_3        244.89        150.91
2      4.0   Stock_4        197.23        342.65
3      5.0   Stock_5        397.50        439.90
4      6.0   Stock_6        479.95        371.40
5      7.0   Stock_7        193.06        178.91

In [32]:
dfl2 = pd.read_csv("Practice_Dataset.csv",skiprows=[2], nrows=6, usecols=[0,1,3,4],
                  index_col=0, names = ["col1","col2","col3","col4"]) 
dfl2

              col2          col3          col4
col1
StockID  StockName  OpeningPrice  ClosingPrice
1          Stock_1        403.21         186.7
3          Stock_3        244.89        150.91
4          Stock_4        197.23        342.65
5          Stock_5         397.5         439.9
6          Stock_6        479.95         371.4

### Data Manipulation

In [47]:
toyota = pd.read_csv("Toyota.csv")
toyota.head()

  Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
0      Corolla        2023                  1.8      21000                 5
1        Camry        2022                  2.5      26000                 5
2         RAV4        2023                  2.5      28000                 5
3   Highlander        2022                  3.5      35000                 7
4       Tacoma        2023                  3.5      33000                 5

In [48]:
toyota.index

RangeIndex(start=0, stop=25, step=1)

In [49]:
toyota.columns

Index(['Vehicle Name', 'Model Year', 'Engine Capacity (L)', 'Price ($)',
       'Seating Capacity'],
      dtype='object')

In [51]:
toyota.describe()

        Model Year  Engine Capacity (L)     Price ($)  Seating Capacity
count    25.000000             25.00000     25.000000         25.000000
mean   2018.200000              2.68400  31560.000000          5.160000
std       9.309493              1.19676  16078.142513          1.374773
min    1995.000000              1.50000  12000.000000          2.000000
25%    2021.000000              1.80000  21000.000000          5.000000
50%    2022.000000              2.40000  28000.000000          5.000000
75%    2023.000000              3.50000  38000.000000          5.000000
max    2023.000000              5.70000  85000.000000          8.000000

In [53]:
toyota.tail()

   Vehicle Name  Model Year  Engine Capacity (L)  Price ($)  Seating Capacity
20         Echo        2019                  1.5      17000                 5
21          MR2        2000                  2.0      23000                 2
22        Paseo        1998                  1.5      14000                 5
23       Tercel        1997                  1.5      12000                 5
24       Previa        1995                  2.4      22000                 7